c5/src/InformationRegisters/ExchangeRates/ExchangeRates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ExchangeRates</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </resources>
  <resources>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </resources>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/CommonModules/CurrenciesSrv/Module.bsl
Function Get ( val Currency, val Date = undefined ) export
	
	actualDate = ? ( Date = undefined or Date = Date ( 1, 1, 1 ), undefined, Date );
	info = InformationRegisters.ExchangeRates.GetLast ( actualDate, new Structure ( "Currency", Currency ) );
	info.Insert ( "Currency", Currency );
	info.Insert ( "Date", Date );
	if ( info.Rate = 0 ) then
		info.Rate = 1;
	endif; 
	if ( info.Factor = 0 ) then
		info.Factor = 1;
	endif; 
	return info;
	
EndFunction
